Improve README file
